cf/Catalogs/бпсТипыОбъектовБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<Catalog>
		<Properties>
			<Name>бпсТипыОбъектовБД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектБДСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектБДИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерОбъектаДляЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/бпсТипыОбъектовБД/Ext/ManagerModule.bsl
Функция ПолучитьТипОбъектаБД(ОбъектБД) Экспорт 
	пТипОбъектаБД = Неопределено;
	ОбъектБДИмяМетаданных = ОбъектБД.Метаданные().Имя;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бпсТипыОбъектовБД.Ссылка,
	|	бпсТипыОбъектовБД.ОбъектБДИмяМетаданных
	|ИЗ
	|	Справочник.бпсТипыОбъектовБД КАК бпсТипыОбъектовБД
	|ГДЕ
	|	бпсТипыОбъектовБД.ОбъектБДИмяМетаданных ПОДОБНО &ОбъектБДИмяМетаданных";
	
	Запрос.УстановитьПараметр("ОбъектБДИмяМетаданных", ОбъектБДИмяМетаданных);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			ВызватьИсключение StrTemplate(NStr("ru = 'Ошибка! Найдено более 1 типа объекта для ОбъектБДИмяМетаданных = [%1]'"), ОбъектБДИмяМетаданных);
		Конецесли;
		Выборка.Следующий();
		пТипОбъектаБД = Выборка.Ссылка;
	КонецЕсли;	
	Возврат пТипОбъектаБД;	
КонецФункции //ПолучитьТипОбъекта(ОбъектБД)

Функция ЭтоСправочникИерархический(ЗНАЧ ТипОбъектаБД) Экспорт 
	пЭтоСправочникИерархический = Ложь;
	Если НЕ ЗначениеЗаполнено(ТипОбъектаБД) Тогда
		Возврат пЭтоСправочникИерархический;
	Конецесли;
	
	Если ТипОбъектаБД.МенеджерОбъекта <> "Справочники" And ТипОбъектаБД.МенеджерОбъекта <> "Catalogs" Тогда
		Возврат пЭтоСправочникИерархический;
	Конецесли;
	
	пМетаданные = Метаданные.Справочники[ТипОбъектаБД.ОбъектБДИмяМетаданных];
	Если пМетаданные.Иерархический И Строка(пМетаданные.ВидИерархии) <> "ИерархияЭлементов" Тогда    //  TODO   ИерархияЭлементов = ???
		пЭтоСправочникИерархический = Истина;
	Конецесли;
	
	Возврат пЭтоСправочникИерархический;
КонецФункции
